{
    "link": "https://www.wikihow.com/Spin-a-Pencil-Around-Your-Middle-Finger",
    "article": "How to Spin a Pencil Around Your Middle Finger",
    "intro": "Sure, you might already know a few people who can spin a pencil around their thumbs. You might even be able to do it yourself, but here's something that will make you stand out in the thumb spinning crowd: spinning a pencil vertically around your middle finger. Let the \"oohs\" and \"aahs\" commence!",
    "points": [
        {
            "name": "Executing the Spin",
            "steps": [
                {
                    "step": "3",
                    "title": "Keep your thumb and pointer finger out of the way.",
                    "subtitle": " In order for the pencil to move all the way around your middle finger, it needs a clear path. Keep your thumb and pointer finger held straight out and stiff so that they don’t interfere with your spin.",
                    "sub-points": [
                        "This can be a little tricky at first. If you’re consistently hitting your thumb or pointer finger, really focus on keeping those out of the way as you do the trick.",
                        "Practice spinning the pencil around your middle finger without catching it a few times. Let it fall on a table in front of you just so you can get the motion down."
                    ]
                },
                {
                    "step": "3",
                    "title": "Keep your thumb and pointer finger out of the way.",
                    "subtitle": " In order for the pencil to move all the way around your middle finger, it needs a clear path. Keep your thumb and pointer finger held straight out and stiff so that they don’t interfere with your spin.",
                    "sub-points": [
                        "This can be a little tricky at first. If you’re consistently hitting your thumb or pointer finger, really focus on keeping those out of the way as you do the trick.",
                        "Practice spinning the pencil around your middle finger without catching it a few times. Let it fall on a table in front of you just so you can get the motion down."
                    ]
                }
            ]
        },
        {
            "name": "Catching the Pencil",
            "steps": [
                {
                    "step": "3",
                    "title": "Roll the pencil onto your ring finger or end the trick.",
                    "subtitle": " You can either put the pencil down to stop spinning it, or you can thrust your pinkie finger out to push the pencil up and around your ring finger. You can spin the pencil endlessly this way if you want to, stopping only when you get tired of it or you need to use your pencil.",
                    "sub-points": [
                        "Spinning a pencil around your ring finger is one of the hardest spins to do because keeping your ring finger stiff is pretty hard."
                    ]
                }
            ]
        },
        {
            "name": "Perfecting Your Technique",
            "steps": [
                {
                    "step": "4",
                    "title": "Add in different finger spins.",
                    "subtitle": " The middle finger spin looks awesome, but you can impress your friends even more by moving from finger to finger. Once you catch the pencil at the end of the spin, keep it held tightly in between your middle and ring finger to set up for the next spin. Then, push your pinkie forwards to spin it around your ring finger. Once you catch that spin, you can spin the pencil up and over your middle finger again, then move to your index finger or even ",
                    "sub-points": [
                        "The middle finger spin is great for class time because you catch it at the end, so your pencil won’t go flying. Spinning it around your thumb can be risky in a school setting, since there’s a potential for it to fling off your hands."
                    ]
                }
            ]
        }
    ]
}