{
    "link": "https://www.wikihow.com/Think-Positively",
    "article": "How to Think Positively",
    "intro": "Having a positive outlook is a choice. You can choose to think thoughts that elevate your mood, throw a more constructive light on difficult situations, and generally color your day with brighter, more hopeful approaches to the things you do. By choosing to take a positive outlook on life, you can begin to shift out of a negative frame of mind and see life as filled with possibilities and solutions instead of worries and obstacles. If you want to know how to think more positively, just follow these tips.",
    "points": [
        {
            "name": "Assessing Your Thinking",
            "steps": [
                {
                    "step": "3",
                    "title": "Keep a diary to reflect your thoughts.",
                    "subtitle": " Recording your thoughts can enable you to step back and evaluate patterns in your thinking. Write down your thoughts and feelings and try to spot any triggers that lead to either positive or negative thoughts. Taking just twenty minutes to follow your pattern of thinking at the end of every day can be a valuable way to identify your negative thoughts and make a plan to change them to positive thoughts.",
                    "sub-points": [
                        "Your journal can take on any form that you like.  If you don’t care to write long-winded reflective paragraphs, you can just make a list of the five most prevalent negative thoughts and positive thoughts you had that day.",
                        "Be sure to give yourself the time and opportunity to evaluate and reflect on the information in the journal.  If you write every day, you may want to reflect at the end of every week."
                    ]
                },
                {
                    "step": "3",
                    "title": "Keep a diary to reflect your thoughts.",
                    "subtitle": " Recording your thoughts can enable you to step back and evaluate patterns in your thinking. Write down your thoughts and feelings and try to spot any triggers that lead to either positive or negative thoughts. Taking just twenty minutes to follow your pattern of thinking at the end of every day can be a valuable way to identify your negative thoughts and make a plan to change them to positive thoughts.",
                    "sub-points": [
                        "Your journal can take on any form that you like.  If you don’t care to write long-winded reflective paragraphs, you can just make a list of the five most prevalent negative thoughts and positive thoughts you had that day.",
                        "Be sure to give yourself the time and opportunity to evaluate and reflect on the information in the journal.  If you write every day, you may want to reflect at the end of every week."
                    ]
                }
            ]
        },
        {
            "name": "Combating Negative Thoughts",
            "steps": [
                {
                    "step": "9",
                    "title": "Visit a peaceful place.",
                    "subtitle": "  It can help to have a personal escape when you need to turn your attitude around.  Many people find that spending a little time outdoors improves their mood.",
                    "sub-points": [
                        "If your workplace has an outdoor area with benches or picnic tables, schedule yourself a little down time to be outside and refresh yourself.",
                        "If you are unable to physically visit an outdoor peaceful place, try meditating and visiting a pleasant outdoor area with perfect weather in your mind."
                    ]
                },
                {
                    "step": "9",
                    "title": "Visit a peaceful place.",
                    "subtitle": "  It can help to have a personal escape when you need to turn your attitude around.  Many people find that spending a little time outdoors improves their mood.",
                    "sub-points": [
                        "If your workplace has an outdoor area with benches or picnic tables, schedule yourself a little down time to be outside and refresh yourself.",
                        "If you are unable to physically visit an outdoor peaceful place, try meditating and visiting a pleasant outdoor area with perfect weather in your mind."
                    ]
                }
            ]
        },
        {
            "name": "Living an Optimistic Life",
            "steps": [
                {
                    "step": "7",
                    "title": "Don't forget to have fun.",
                    "subtitle": " People who allow themselves regular fun in their lives tend to be happier and more positive because it isn't all drudgery and never-ending monotony. Fun breaks up the hard work and challenges. Remember that fun does not look the same for everyone, so you may need to spend time finding an activity that is fun for you.",
                    "sub-points": [
                        "Always make time for laughter. Hang out with friends who make you laugh, go to a comedy club, or watch a funny movie. It'll be hard to think negatively when your funny bone is being tickled."
                    ]
                }
            ]
        }
    ]
}