{
    "link": "https://www.wikihow.com/Burn-Sage",
    "article": "How to Use Sage to Cleanse Your Home of Bad Vibes",
    "intro": " Humans have used sage for its cleansing and medicinal properties since time immemorial. Many believe that sage burning, also known as smudging, can purify a space and chase out negative energy. If you want to give smudging a try, you've come to the right place! In this article, we'll explain what kind of sage to use, where to get it, and how to burn it properly (and safely) in order to reap the most benefits. To learn how you can take part in this rich cultural tradition, read on!",
    "points": [
        {
            "name": "Selecting Sage",
            "steps": [
                {
                    "step": "4",
                    "title": " for about a week before using it.",
                    "subtitle": " Gather the sage in a bundle, tie it tightly, and hang it up in a dry space so the leaves and stalks dry evenly. This should take about a week or so, depending on the weather. The sage is dry enough to burn if it crackles when you gently squeeze it.",
                    "sub-points": [
                        "If you hang your sage outside, remember to bring it inside or cover it at night. If dew or moisture seep into your sage bundle overnight, this will undermine the drying process.",
                        "Do not dry your sage in an oven or microwave. This will toast the essential oil out of the bundle, speeding up the deterioration of the plant and muting the purifying effect of burning it."
                    ]
                },
                {
                    "step": "4",
                    "title": " for about a week before using it.",
                    "subtitle": " Gather the sage in a bundle, tie it tightly, and hang it up in a dry space so the leaves and stalks dry evenly. This should take about a week or so, depending on the weather. The sage is dry enough to burn if it crackles when you gently squeeze it.",
                    "sub-points": [
                        "If you hang your sage outside, remember to bring it inside or cover it at night. If dew or moisture seep into your sage bundle overnight, this will undermine the drying process.",
                        "Do not dry your sage in an oven or microwave. This will toast the essential oil out of the bundle, speeding up the deterioration of the plant and muting the purifying effect of burning it."
                    ]
                }
            ]
        },
        {
            "name": "Smudging with Sage",
            "steps": [
                {
                    "step": "10",
                    "title": "Consider burning sage in your home more often.",
                    "subtitle": " If you can burn sage at least once a week, you may notice that the practice imbues your home with light and calm. You don't necessarily need to perform a full smudging ceremony each time you burn sage; it depends on how strictly you wish to adhere to the traditional rituals. Consider burning sage casually, as you would burn incense.",
                    "sub-points": [
                        "Try burning sage to acknowledge significant changes in your home: a new member of the family, a new pet, a new job, a new passion.",
                        "The practice of burning sage can be whatever you want it to be. The important thing is that you believe that the sage can help you make your life more meaningful."
                    ]
                },
                {
                    "step": "10",
                    "title": "Consider burning sage in your home more often.",
                    "subtitle": " If you can burn sage at least once a week, you may notice that the practice imbues your home with light and calm. You don't necessarily need to perform a full smudging ceremony each time you burn sage; it depends on how strictly you wish to adhere to the traditional rituals. Consider burning sage casually, as you would burn incense.",
                    "sub-points": [
                        "Try burning sage to acknowledge significant changes in your home: a new member of the family, a new pet, a new job, a new passion.",
                        "The practice of burning sage can be whatever you want it to be. The important thing is that you believe that the sage can help you make your life more meaningful."
                    ]
                }
            ]
        }
    ]
}