{
    "link": "https://www.wikihow.com/Drop-an-Egg-Without-It-Breaking",
    "article": "How to Drop an Egg Without It Breaking",
    "intro": "The egg drop is a classic science experiment, but it can still be pretty intimidating if you've never successfully completed it. To drop an egg without breaking it, you need to find a way to minimize the force of the impact and its effects on the delicate eggshell. The best ways to do this are to cushion the egg while also changing the way it drops and the way it lands.",
    "points": [
        {
            "name": "Ice method",
            "steps": []
        },
        {
            "name": "Cushioning and Protecting the Egg",
            "steps": [
                {
                    "step": "4",
                    "title": "Let the egg float.",
                    "subtitle": " If you can keep the egg floating in water during the drop and upon impact, the force of the impact should distribute itself evenly throughout the water and have very little effect on the egg itself.",
                    "sub-points": [
                        "Place the egg inside of a tin can, plastic box, or other durable container. This container should be about five times as large as the egg.",
                        "Fill the rest of the container with water and add a handful of salt. The egg will float better in salt water than in normal water. Make sure that the entire container is filled with water and that it is well sealed before you drop it."
                    ]
                },
                {
                    "step": "4",
                    "title": "Let the egg float.",
                    "subtitle": " If you can keep the egg floating in water during the drop and upon impact, the force of the impact should distribute itself evenly throughout the water and have very little effect on the egg itself.",
                    "sub-points": [
                        "Place the egg inside of a tin can, plastic box, or other durable container. This container should be about five times as large as the egg.",
                        "Fill the rest of the container with water and add a handful of salt. The egg will float better in salt water than in normal water. Make sure that the entire container is filled with water and that it is well sealed before you drop it."
                    ]
                }
            ]
        },
        {
            "name": "Changing the Way the Egg Drops",
            "steps": [
                {
                    "step": "3",
                    "title": "Make a parachute.",
                    "subtitle": " If you can design a parachute for the container holding your egg, you can reduce the velocity at which the egg drops. Since the egg is falling at a slower speed, the force of the impact will be much less once it hits the ground. Less force means that your egg might have a chance at survival.",
                    "sub-points": [
                        "There are a few different parachutes you can try, but one of the easiest materials to use is a plastic shopping bag. Place the egg in a box, along with any cushioning you may choose to use. Attach a large plastic grocery bag to the top of the box using tape or a stapler. Make sure that the handles are near the sides of the box so that enough air can get inside the bag as the box drops.",
                        "When you drop the box, make sure that the side you attach the parachute to is at the top. This will allow air to fill the bag and cause it to open up, reducing the speed of the descent as a result."
                    ]
                },
                {
                    "step": "3",
                    "title": "Make a parachute.",
                    "subtitle": " If you can design a parachute for the container holding your egg, you can reduce the velocity at which the egg drops. Since the egg is falling at a slower speed, the force of the impact will be much less once it hits the ground. Less force means that your egg might have a chance at survival.",
                    "sub-points": [
                        "There are a few different parachutes you can try, but one of the easiest materials to use is a plastic shopping bag. Place the egg in a box, along with any cushioning you may choose to use. Attach a large plastic grocery bag to the top of the box using tape or a stapler. Make sure that the handles are near the sides of the box so that enough air can get inside the bag as the box drops.",
                        "When you drop the box, make sure that the side you attach the parachute to is at the top. This will allow air to fill the bag and cause it to open up, reducing the speed of the descent as a result."
                    ]
                }
            ]
        },
        {
            "name": "Changing the Landing Site",
            "steps": [
                {
                    "step": "2",
                    "title": "Choose a grassy location.",
                    "subtitle": " If you can choose the landing site, opt for a grassy location instead of a concrete sidewalk or parking lot. Grass and soil are naturally softer than concrete or stone, so the force of the impact will automatically be much smaller.",
                    "sub-points": [
                        "For even better results, drop the egg after a good rainstorm so that the ground is very soft. Try to avoid dropping the egg during a drought, since soil tends to be much harder and more firmly packed in these conditions."
                    ]
                }
            ]
        }
    ]
}