{
    "link": "https://www.wikihow.com/Tie-a-Knot-in-a-Cherry-Stem-With-Your-Tongue",
    "article": "How to Tie a Knot in a Cherry Stem With Your Tongue",
    "intro": "Tying a knot in a cherry stem with your tongue is a fun party trick, whether you use it to impress your friends or show off your seductive side. This trick will take some practice but is definitely achievable. To master it, try using either the classic method or the alternative method. For either one, you’ll need to choose a long and pliable stem, place it on your tongue, use your tongue and teeth to manipulate it into a loop, then finish off the knot.",
    "points": [
        {
            "name": "Choosing and Preparing Your Stem",
            "steps": [
                {
                    "step": "4",
                    "title": "Soften the stems of fresh cherries first.",
                    "subtitle": " If you’re using a fresh cherry stem, soften it by holding it in your mouth for 10-30 seconds while chewing and swishing it around. Don’t chew the stem so much that it becomes mushy--you just want it to be malleable.",
                    "sub-points": [
                        "Be careful not to swallow the stem while moving it around in your mouth!",
                        "If you’re using fresh cherry stems, make sure they’re room temperature. Practicing too much with refrigerated stems can make your tongue bleed."
                    ]
                },
                {
                    "step": "4",
                    "title": "Soften the stems of fresh cherries first.",
                    "subtitle": " If you’re using a fresh cherry stem, soften it by holding it in your mouth for 10-30 seconds while chewing and swishing it around. Don’t chew the stem so much that it becomes mushy--you just want it to be malleable.",
                    "sub-points": [
                        "Be careful not to swallow the stem while moving it around in your mouth!",
                        "If you’re using fresh cherry stems, make sure they’re room temperature. Practicing too much with refrigerated stems can make your tongue bleed."
                    ]
                }
            ]
        },
        {
            "name": "Using the Classic Method",
            "steps": [
                {
                    "step": "4",
                    "title": "Grab one end of the stem with your fingers.",
                    "subtitle": " Keep biting down on one end as you pull the knotted stem out of your mouth by the other end. This will tighten your knot and keep it intact before you reveal it.",
                    "sub-points": [
                        "Present the tied stem with a flourish, holding the loop so everyone can clearly see the knot."
                    ]
                }
            ]
        },
        {
            "name": "Using an Alternative Method",
            "steps": [
                {
                    "step": "3",
                    "title": "Bite and pull away your teeth.",
                    "subtitle": " Tighten the knot by biting down with your front teeth, then stick out your tongue to reveal the knotted stem. Be careful not to touch it too much before revealing it, as the knot could come apart.",
                    "sub-points": [
                        "When you reveal the the tied stem, hold it by the loop to showcase the knot and add a little theatrical flourish."
                    ]
                }
            ]
        }
    ]
}