{
    "link": "https://www.wikihow.com/Spin-a-Drumstick",
    "article": "How to Spin a Drumstick",
    "intro": "Playing the drums is pretty cool, but playing the drums and incorporating stick tricks while you play is even cooler. Doing stick tricks can make you come off as more experienced and confident in your abilities. Most stick tricks are fairly easy to learn, but in order to master them, you must put in the practice.",
    "points": [
        {
            "name": "Spinning the Drumstick Like a Baton",
            "steps": [
                {
                    "step": "3",
                    "title": "Incorporate a figure eight movement.",
                    "subtitle": " As you alternate your fingers and the drumstick is moving back and forth like a pendulum, slightly roll your wrist to get some fluidity to the movement of the stick. As the stick spins, begin making a circular, figure eight motion with your fingers.",
                    "sub-points": [
                        "As you continue to spin the stick, it will naturally slide down to the end of the stick due to gravity. Because of this, you will have to eventually readjust the positioning of the stick."
                    ]
                }
            ]
        },
        {
            "name": "Spinning the Drumstick Over Your Pointer Finger",
            "steps": [
                {
                    "step": "5",
                    "title": "Catch the drumstick.",
                    "subtitle": " The stick will make one full rotation until it is back in its starting position. As the stick comes back to its starting position, catch it using all of you fingers and thumb.",
                    "sub-points": [
                        "Once back in the starting position, you can continue to spin the stick."
                    ]
                }
            ]
        },
        {
            "name": "Spinning the Drumstick With Four Fingers",
            "steps": [
                {
                    "step": "4",
                    "title": "Transfer the stick from your pinky to your pointer finger.",
                    "subtitle": " As the drumstick spins around your pinky finger, it will come back around to the front (palm side) of your hand. When it is on the palm side, tuck your pointer finger down. When the stick is horizontal and perpendicular to your fingers, lift your pointer finger back up so it is in front of the stick.",
                    "sub-points": [
                        "At this position, your pinky finger and pointer finger should be in front of the drumstick, while your middle and ring fingers should be behind the drumstick.",
                        "As you move your pointer finger to be in front of the drumstick, slowly release your pinky and ring finger so the only two fingers touching the drumstick are your pointer finger (which is in front of the stick) and your middle finger (which is behind the stick). This will put you back in the starting position and you can continue spinning the drumstick."
                    ]
                },
                {
                    "step": "4",
                    "title": "Transfer the stick from your pinky to your pointer finger.",
                    "subtitle": " As the drumstick spins around your pinky finger, it will come back around to the front (palm side) of your hand. When it is on the palm side, tuck your pointer finger down. When the stick is horizontal and perpendicular to your fingers, lift your pointer finger back up so it is in front of the stick.",
                    "sub-points": [
                        "At this position, your pinky finger and pointer finger should be in front of the drumstick, while your middle and ring fingers should be behind the drumstick.",
                        "As you move your pointer finger to be in front of the drumstick, slowly release your pinky and ring finger so the only two fingers touching the drumstick are your pointer finger (which is in front of the stick) and your middle finger (which is behind the stick). This will put you back in the starting position and you can continue spinning the drumstick."
                    ]
                }
            ]
        },
        {
            "name": "Spinning the Drumstick on Your Palm",
            "steps": []
        }
    ]
}