{
    "link": "https://www.wikihow.com/Be-Optimistic",
    "article": "How to Be More Optimistic",
    "intro": "Being optimistic doesn't mean you're walking around with rose-colored glasses thinking everything is awesome—it just means that you focus on the good instead of dwelling on the bad, that you expect things to go well despite temporary setbacks. Do you wish you had a more optimistic outlook? Well, you've come to the right place. We talked to several expert life coaches to uncover how you can be more optimistic and the benefits you'll gain as a result.",
    "points": [
        {
            "name": "Becoming More Optimistic",
            "steps": [
                {
                    "step": "17",
                    "title": "Reinforce the cycle of optimism in your life.",
                    "subtitle": " The great thing about optimism is that it really builds on itself. It might feel awkward or unnatural at first, but the more you engage in positive thinking and action, the easier it is to keep that momentum going. Eventually, you'll find being optimistic is second nature to you and the positive thoughts will come automatically without you really having to consciously work on it.",
                    "sub-points": [
                        "Life coach Michelle Shahbazyan notes that \"it creates a positive feedback loop where you do good, you feel good, you do more good, you feel better.\""
                    ]
                }
            ]
        },
        {
            "name": "Benefits of Optimism",
            "steps": [
                {
                    "step": "10",
                    "title": "More friends",
                    "subtitle": " People just like being around positive people. As a result, someone who's optimistic is likely to have more friends than someone who's generally pessimistic. They also typically have stronger emotional bonds with their friends and family than more pessimistic people do.",
                    "sub-points": [
                        "Even when optimistic people are in situations where they may not have a lot of friends or get the emotional support they need, they tend to be more satisfied with their social life and social networks than people who are more pessimistic."
                    ]
                }
            ]
        }
    ]
}