{
    "link": "https://www.wikihow.com/Make-Your-Dad-Happy",
    "article": "How to Make Your Dad Happy",
    "intro": "Everybody wants a healthy relationship with their dad. When your dad is happy with you, you’ll get the best treatment from him and most likely be happy too.",
    "points": [
        {
            "name": "Getting Along",
            "steps": [
                {
                    "step": "5",
                    "title": "Respect him even if you disagree.",
                    "subtitle": " It can be difficult not to answer back, especially if you don’t agree with something your dad is saying or if he’s not granting you permission for something you desperately want. Exercise some self-discipline and wait to have a discussion when you’re calm. If you’re feeling angry, take slow, deep breaths to help you calm down. If you can, sit down and have a drink of cool water. This should help you calm down.",
                    "sub-points": [
                        "Always seek to understand your dad’s point of view. He may have a valid reason for not allowing you to do something or for thinking a different way. What you may see as a restriction may be his way of protection.",
                        "If your dad is upset, try to think of other reasons that he could be upset. Is he tired? Did he have a long day at work? Is he stressed out about something? He may not be upset because of you."
                    ]
                },
                {
                    "step": "5",
                    "title": "Respect him even if you disagree.",
                    "subtitle": " It can be difficult not to answer back, especially if you don’t agree with something your dad is saying or if he’s not granting you permission for something you desperately want. Exercise some self-discipline and wait to have a discussion when you’re calm. If you’re feeling angry, take slow, deep breaths to help you calm down. If you can, sit down and have a drink of cool water. This should help you calm down.",
                    "sub-points": [
                        "Always seek to understand your dad’s point of view. He may have a valid reason for not allowing you to do something or for thinking a different way. What you may see as a restriction may be his way of protection.",
                        "If your dad is upset, try to think of other reasons that he could be upset. Is he tired? Did he have a long day at work? Is he stressed out about something? He may not be upset because of you."
                    ]
                }
            ]
        },
        {
            "name": "Being Responsible",
            "steps": [
                {
                    "step": "5",
                    "title": "Take care of your siblings.",
                    "subtitle": " Give your dad a peaceful, comfortable and warm environment to come home to. Try your hardest to get along with your siblings. Don’t bully your younger ones and don’t annoy your older ones. Help them with any homework they might not understand or any problem they might be going through. Do fun things together. If you are old enough to drive and have a car, offer to help your dad by taking your siblings where they need to go.",
                    "sub-points": [
                        "It’s natural to fight occasionally with your siblings but try your hardest to get along with them."
                    ]
                }
            ]
        },
        {
            "name": "Doing Well in School",
            "steps": [
                {
                    "step": "4",
                    "title": "Make good friends.",
                    "subtitle": " Show your dad that you’re a good judge of character. Befriend people who you see do well in school. Look for those that have a good reputation with others and their teachers and who perform highly in class and whom you think have good character and stay out of trouble. You might learn from them and being friends with them might help keep you out of trouble too. If you like, you can form study groups with them.",
                    "sub-points": [
                        "Never do anything just because your friends are doing them. Think your actions through. If you’re having trouble with peer pressure, talk to your dad about it or speak to a school counsellor."
                    ]
                }
            ]
        }
    ]
}