{
    "link": "https://www.wikihow.com/Sanpaku-Eyes-Death",
    "article": "All About the Sanpaku Eye Superstition",
    "intro": "From TikTok theories to YouTube videos, the sanpaku eye superstition seems to be all over the internet. But what exactly ",
    "points": [
        {
            "name": "What are sanpaku eyes?",
            "steps": [
                {
                    "step": "None",
                    "title": "Sanpaku eyes are irises that are surrounded by white on 3 sides.",
                    "subtitle": "The word (written as 三白 in Japanese) literally translates to “three” (san) and “white” (paku), referring to the white sclera that’s visible around 3 sides of a person’s iris. According to superstition, this extra portion of white can appear either below or above a person’s iris.",
                    "sub-points": [
                        "In non-sanpaku eyes, the iris directly borders the upper and lower eyelids, and the white sclera are only visible on the left and right sides of the eyes."
                    ]
                }
            ]
        },
        {
            "name": "What is the sanpaku superstition or curse?",
            "steps": [
                {
                    "step": "2",
                    "title": "The superstition was popularized by George Ohsawa in the 1960s.",
                    "subtitle": "In his 1965 book titled  (published under his pen name Sakurazawa Nyoiti), Ohsawa introduces sanpaku as “a condition of the human eye which presents three white sides or areas around the iris.” According to Ohsawa, the concept of sanpaku has existed in the realm of Eastern philosophy for millennia and is a sign of physical, spiritual, or physiological imbalance. In his book, Ohsawa advocates for the macrobiotic diet, which he claims can cure those who are sanpaku.",
                    "sub-points": [
                        "The macrobiotic diet, originally created by Ohsawa, is a combination of dietary suggestions (like making your diet 40-60% whole grains, 20-30% produce, and 10-25% bean products) and lifestyle practices (not using microwaves, staying away from caffeine and alcohol, and more). Modern health experts warn that diets like this one aren’t always the healthiest, and can lead to nutrient deficiencies (like vitamins, iron, protein, and calcium)."
                    ]
                }
            ]
        },
        {
            "name": "Sanpaku Eye Types",
            "steps": [
                {
                    "step": "2",
                    "title": "Yang Sanpaku (Above)",
                    "subtitle": "While people with yin sanpaku are most likely to be victims of tragedy and violence, people with yang sanpaku are more likely to be  of tragedy and violence. As far as superstition goes, people with visible white above their eyes are often violent towards others.",
                    "sub-points": [
                        "Ohsawa doesn’t really discuss yang sanpaku specifically in his book, but it’s still widely considered part of sanpaku lore."
                    ]
                }
            ]
        },
        {
            "name": "Medical Causes for Sanpaku Eyes",
            "steps": [
                {
                    "step": "4",
                    "title": "Lower blepharoplasty complications",
                    "subtitle": "After a blepharoplasty (eyelid surgery), some patients experience a scleral show and ectropion around their eyelids. If you’re experiencing this after your procedure, talk with your surgeon and see what your options are.",
                    "sub-points": [
                        "Keep in mind that it takes weeks and even months to completely heal from a blepharoplasty."
                    ]
                }
            ]
        },
        {
            "name": "Key Takeaways",
            "steps": [
                {
                    "step": "2",
                    "title": "The sanpaku belief was popularized to promote a specific diet.",
                    "subtitle": " While the sanpaku superstition existed long before the 1960s, it was George Ohsawa’s discussion and explanation of the belief that really made it popular in Western society. In his book , Ohsawa claims that “nearly every American he has seen is more or less sanpaku,” and uses this “fact” to promote the macrobiotic diet (a diet he is historically credited for creating).",
                    "sub-points": [
                        "In many ways, you could argue that this popularized superstition originated as a marketing scheme—not as a true predictor of someone’s fate."
                    ]
                }
            ]
        }
    ]
}