{
    "link": "https://www.wikihow.com/Sharpen-Your-Pencil-at-School-Without-a-Sharpener",
    "article": "How to Sharpen Your Pencil at School Without a Sharpener",
    "intro": "Imagine: You're in the middle of a test and your pencil breaks or is too dull to make clear marks, but your teacher gave clear instructions that no one is to get up from their desk. Or perhaps you are outside sketching for art class and your pencil—your only drawing tool—suddenly snaps. What can you do? Fear not! All hope is not lost—read our advice on ways to salvage your pencil.",
    "points": [
        {
            "name": "Using a Rough Surface to Sharpen Your Pencil",
            "steps": [
                {
                    "step": "3",
                    "title": "Rub your pencil against a rough foundational structure.",
                    "subtitle": " If your pencil breaks and you're without a sharpener (or nail file or sandpaper), take a look around you: Are you sitting next to a brick wall? Are you on pavement or concrete?",
                    "sub-points": [
                        "These rough surfaces should work well to help you out of your predicament: you should be able to hone your pencil tip by rubbing it firmly on the pavement, against a brick wall, or even on the mortar in between the bricks."
                    ]
                }
            ]
        },
        {
            "name": "Using Something Sharp",
            "steps": [
                {
                    "step": "7",
                    "title": "Use your nails and teeth.",
                    "subtitle": " If you're not adverse to using your nails and teeth as tools, you may be able to use them to push back (or carefully nibble away) some of the wood of your pencil. Once you've revealed enough of the graphite to begin working again, consider honing it to a tip using some of our other suggestions.",
                    "sub-points": [
                        "Be very careful not to swallow any of the wood shavings. You also want to avoid ingesting the graphite—not because it's toxic like old lead pencils were—but just because it's gross! You also don't want to discolor your teeth."
                    ]
                }
            ]
        },
        {
            "name": "Using Smooth Surfaces to Sharpen Your Pencil Tip",
            "steps": [
                {
                    "step": "3",
                    "title": "Rub your pencil tip against your shoe.",
                    "subtitle": " If you don't want to mark up your paper or if you don't have a spare folder handy, try rubbing the edge of your dulled pencil tip against the rubber of your shoe sole.",
                    "sub-points": [
                        "Again, be sure to rotate the pencil and don't push too firmly in order to protect against snapping off the tip or rubbing it down altogether."
                    ]
                }
            ]
        },
        {
            "name": "Being Prepared in Advance",
            "steps": []
        }
    ]
}