{
    "link": "https://www.wikihow.com/Candle-Wax-Reading",
    "article": "How to Perform a Candle Wax Reading",
    "intro": "Candle divination, or ceromancy, is a time-honored scrying method that can offer insight into your energies or even tell you the status of a recent spell. All you need to perform your own wax divination is a candle, a match, and an open mind. We interviewed expert spiritual life coaches to compile a simple guide to reading and scrying candle wax, including how to interpret wax patterns and how to perform a wax reading.",
    "points": [
        {
            "name": "Interpreting Wax Patterns",
            "steps": [
                {
                    "step": "8",
                    "title": "Burned on one side",
                    "subtitle": " Each side of your candle corresponds to an element and a faculty—the west side is water and emotions, north is earth and physical sensations, east is air and communication, and south is fire and matters of will. If your candle burns through only one side, that faculty may be experiencing blockages, like a lack of physical touch if burns through the north side of the candle.",
                    "sub-points": [
                        "If the candle burns on all but one side, those other faculties may be lacking, but the side left standing has proven strong."
                    ]
                }
            ]
        },
        {
            "name": "Performing a Candle Wax Reading",
            "steps": [
                {
                    "step": "7",
                    "title": "Analyze the wax dripping after the candle has burned out.",
                    "subtitle": " For a short reading, feel free to blow out your candle yourself and move on to interpretation. For a longer reading that may provide more insight, wait for the candle to go out on its own. This can offer more signs, like whether or not the candle burned all the way down before it went out.",
                    "sub-points": [
                        "You don’t need to be present the whole time the candle burns. You might come back later to analyze the wax once the candle has run its course."
                    ]
                }
            ]
        }
    ]
}