{
    "link": "https://www.wikihow.com/Store-Cut-Ginger",
    "article": "How to Store Cut Ginger",
    "intro": "Ginger is an essential ingredient in many different Asian and Thai recipes, including soups, curries, and marinades; it’s also often used to make delicious baked goods, like ginger cake! If you buy it fresh but don’t cook with it frequently, you might find that it shrivels and goes bad before you’ve had a chance to use it all. Thankfully, there are several different ways you can store cut ginger so that you can always have it on hand to add to your favorite dishes.",
    "points": [
        {
            "name": "Keeping Ginger in the Fridge",
            "steps": [
                {
                    "step": "4",
                    "title": "Use fresh ginger within 4-6 weeks for the freshest taste.",
                    "subtitle": " Always visually check your ginger before using it to make sure it’s still in good condition. If you’re nearing the end of the 4-6 weeks or have noticed that the ginger is starting to wrinkle or age, you can transfer it to the freezer.",
                    "sub-points": [
                        "If the ginger looks discolored, becomes soft to the touch, or emits a weird smell, it has probably gone bad and shouldn’t be consumed."
                    ]
                }
            ]
        },
        {
            "name": "Grating and Freezing Fresh Ginger",
            "steps": [
                {
                    "step": "6",
                    "title": "Take out a portion of frozen ginger whenever you need it for a recipe.",
                    "subtitle": " Whether you’re making soup or stir-fry or a ginger cake, all you have to do is take out as many frozen pieces of ginger as you need. For dishes cooked on the stovetop, you can add it straight to the pan—the heat will thaw the ginger quickly. For baked goods, place the ginger in a small bowl on the counter and let it come to room temperature before using it.",
                    "sub-points": [
                        "Since fresh ginger can quickly go bad and shrivel, preparing and storing it this way ensures you’ll always have some available when you need it."
                    ]
                }
            ]
        },
        {
            "name": "Pickling Sliced Ginger",
            "steps": [
                {
                    "step": "7",
                    "title": "Keep the pickled ginger in the fridge and enjoy it within 4-6 weeks.",
                    "subtitle": " Remember to keep the lid tightly secured on the container for maximum freshness. The ginger will probably still be safe to consume after the 4-6 weeks have passed, but the texture and taste might not be as good.",
                    "sub-points": [
                        "If you notice any discoloration, strange smells, or mold, discard the ginger right away.",
                        "While pickled ginger is good for you, lacto-fermented ginger is another option that doesn't use vinegar. To try this option, peel and slice fresh ginger into thin slices. Pound lightly to release juices. Pack it into a quart-size mason jar, leaving at least an inch (2.5cm) air space at the top. Prepare the brine by gently heating 1 cup of filtered water and add 2 tablespoons of sea salt. Heat the water just enough to dissolve the salt and not any warmer. Once it dissolves, pour it into the mason jar. Add more filtered water as needed to just cover the ginger. Leave at least one inch (2.5cm) air space between the covered ginger and the jar rim. Cover jar tightly with the lid and keep in a dark, room temperature space for about 3 days. Then, it’s ready to eat––just a small amount with meals is plenty."
                    ]
                },
                {
                    "step": "7",
                    "title": "Keep the pickled ginger in the fridge and enjoy it within 4-6 weeks.",
                    "subtitle": " Remember to keep the lid tightly secured on the container for maximum freshness. The ginger will probably still be safe to consume after the 4-6 weeks have passed, but the texture and taste might not be as good.",
                    "sub-points": [
                        "If you notice any discoloration, strange smells, or mold, discard the ginger right away.",
                        "While pickled ginger is good for you, lacto-fermented ginger is another option that doesn't use vinegar. To try this option, peel and slice fresh ginger into thin slices. Pound lightly to release juices. Pack it into a quart-size mason jar, leaving at least an inch (2.5cm) air space at the top. Prepare the brine by gently heating 1 cup of filtered water and add 2 tablespoons of sea salt. Heat the water just enough to dissolve the salt and not any warmer. Once it dissolves, pour it into the mason jar. Add more filtered water as needed to just cover the ginger. Leave at least one inch (2.5cm) air space between the covered ginger and the jar rim. Cover jar tightly with the lid and keep in a dark, room temperature space for about 3 days. Then, it’s ready to eat––just a small amount with meals is plenty."
                    ]
                }
            ]
        },
        {
            "name": "Drying and Grinding Ginger",
            "steps": [
                {
                    "step": "6",
                    "title": "Grind dried ginger in a coffee or spice grinder to make ground ginger.",
                    "subtitle": " You can grind it all at once and store it in an airtight container, or just grind enough for the meal you’re making. Make sure the coffee or spice grinder is clean and dry before you use it so the ginger doesn’t get contaminated with other spices.",
                    "sub-points": [
                        "A 1/4 cup of dehydrated ginger will make about 1 tablespoon (5.4 grams) of ground ginger.",
                        "Ground ginger will be most potent for about a month. After that, it may start to lose its aroma and flavor."
                    ]
                },
                {
                    "step": "6",
                    "title": "Grind dried ginger in a coffee or spice grinder to make ground ginger.",
                    "subtitle": " You can grind it all at once and store it in an airtight container, or just grind enough for the meal you’re making. Make sure the coffee or spice grinder is clean and dry before you use it so the ginger doesn’t get contaminated with other spices.",
                    "sub-points": [
                        "A 1/4 cup of dehydrated ginger will make about 1 tablespoon (5.4 grams) of ground ginger.",
                        "Ground ginger will be most potent for about a month. After that, it may start to lose its aroma and flavor."
                    ]
                }
            ]
        }
    ]
}