{
    "link": "https://www.wikihow.com/Flip-Pens",
    "article": "How to Flip Pens",
    "intro": "Flipping pens is a fun way to pass the time during school or work. To learn the basics, start by flipping the pen over your middle finger. Then, learn how to flip the pen using your thumb and pass the pen in between your fingers. With practice and some finger muscles, you can easily flip pens.",
    "points": [
        {
            "name": "Flipping Pens with Your Middle Finger",
            "steps": [
                {
                    "step": "6",
                    "title": "Catch the pen in between your index finger and thumb.",
                    "subtitle": " To nail the trick, let the pen slide in between your thumb and index finger after it flips over your middle finger. Since the pen already has momentum, it should easily fall into place.",
                    "sub-points": [
                        "At this point, the tip of the pen should be in between your thumb and index finger, and the rest of the pen should face toward your other fingers."
                    ]
                }
            ]
        },
        {
            "name": "Using Your Thumb",
            "steps": [
                {
                    "step": "4",
                    "title": "Catch the pen in between your middle finger and thumb.",
                    "subtitle": " After the pen flips around your thumb, bring your thumb down to stop it on your middle finger. Keep your index finger out of the way as you do this. This trick is known as the \"Thumbaround.\"",
                    "sub-points": [
                        "This way, the pen does not keep flipping off your hand."
                    ]
                }
            ]
        },
        {
            "name": "Passing Between Your Fingers",
            "steps": [
                {
                    "step": "6",
                    "title": "Continue rotating the pen up and down your fingers to perform the trick.",
                    "subtitle": " Do these motions consecutively to quickly flip the pen over your fingers. After you flip the pen into your middle and index finger, start the process over again to continuously flip the pen. This is known as the “finger pass” technique.",
                    "sub-points": [
                        "Try this trick after you master the “thumbaround,” as it is slightly more difficult."
                    ]
                }
            ]
        }
    ]
}