{
    "link": "https://www.wikihow.com/Get-Happy-when-You%27re-Sad",
    "article": "How to Get Happy when You're Sad",
    "intro": "Everyone feels sad sometimes. In many cases, sadness is a normal human reaction to different life changes and events. The good news is that everyone also has the capacity to feel happiness and that there are things you can do to unlock that capacity and feel better.",
    "points": [
        {
            "name": "Finding Happiness Within",
            "steps": []
        },
        {
            "name": "Assessing Your Sadness",
            "steps": [
                {
                    "step": "3",
                    "title": "Reflect on your emotions.",
                    "subtitle": " Has something happened recently in your life that helps explain what you've been feeling? For example, did you just experience a breakup or a loss in your family? Identifying the cause of your sadness will better help you understand and move past it. Reflecting on the external factors will also confirm that you are experiencing a normal reaction of sadness to something that happened, and not chronic depression.",
                    "sub-points": [
                        "In addition, knowing what is making you sad will also help you determine the appropriate methods to alleviate your sadness. The sadness you feel after you've broken up with your boyfriend of 3 months, for instance, will be quite different than the sadness you feel if your husband of 10 years has recently passed away.",
                        "If you have a suffered a major loss or trauma, it may be useful to consult a mental health professional who can work with you to develop coping strategies for your sadness and grief. According to the , the most stressful events that affect individuals' mental and physical well-being include the death of a spouse, divorce, marital separation, and the death of a close family member. In such cases where sadness is likely to be more extreme, the techniques described below may be useful in conjunction with therapy."
                    ]
                },
                {
                    "step": "3",
                    "title": "Reflect on your emotions.",
                    "subtitle": " Has something happened recently in your life that helps explain what you've been feeling? For example, did you just experience a breakup or a loss in your family? Identifying the cause of your sadness will better help you understand and move past it. Reflecting on the external factors will also confirm that you are experiencing a normal reaction of sadness to something that happened, and not chronic depression.",
                    "sub-points": [
                        "In addition, knowing what is making you sad will also help you determine the appropriate methods to alleviate your sadness. The sadness you feel after you've broken up with your boyfriend of 3 months, for instance, will be quite different than the sadness you feel if your husband of 10 years has recently passed away.",
                        "If you have a suffered a major loss or trauma, it may be useful to consult a mental health professional who can work with you to develop coping strategies for your sadness and grief. According to the , the most stressful events that affect individuals' mental and physical well-being include the death of a spouse, divorce, marital separation, and the death of a close family member. In such cases where sadness is likely to be more extreme, the techniques described below may be useful in conjunction with therapy."
                    ]
                }
            ]
        },
        {
            "name": "Doing Fun Activities",
            "steps": [
                {
                    "step": "5",
                    "title": "Take a  or a bath.",
                    "subtitle": " You'll be amazed at how much of a lift taking a shower can give you. Consider making your shower colder than you would normally. Cold showers can be very beneficial and healing; research has suggested that they can improve circulation and blood flow, reduce stress and tension, and boost your mood. The cold releases endorphins into your blood stream and brain and gives you a feeling of rejuvenation and positivity.",
                    "sub-points": [
                        "If you're more inclined to baths, try putting some Epsom salts (about 1-2 cups) in the bath. In addition to helping detoxify the body and reduce tension, Epsom salts are reported to trigger the release of endorphins, and thereby reduce stress and improve mood."
                    ]
                }
            ]
        },
        {
            "name": "Being Social",
            "steps": [
                {
                    "step": "4",
                    "title": "Focus on others.",
                    "subtitle": " Giving your time and energy to help others will not only help you stay busy, but will also give you a sense of reward and purpose, making you feel better about yourself and your situation.",
                    "sub-points": [
                        "Find a volunteer activity that you're passionate about such as helping out at a homeless shelter or food kitchen, caring for or walking stray dogs, or volunteering at a senior's home.",
                        "Even doing something small for someone else, like letting someone go ahead of you in the line at the grocery store, can make you feel better. Acts of kindness increase your sense of well-being because they are concrete things that you can do, and not just think."
                    ]
                },
                {
                    "step": "4",
                    "title": "Focus on others.",
                    "subtitle": " Giving your time and energy to help others will not only help you stay busy, but will also give you a sense of reward and purpose, making you feel better about yourself and your situation.",
                    "sub-points": [
                        "Find a volunteer activity that you're passionate about such as helping out at a homeless shelter or food kitchen, caring for or walking stray dogs, or volunteering at a senior's home.",
                        "Even doing something small for someone else, like letting someone go ahead of you in the line at the grocery store, can make you feel better. Acts of kindness increase your sense of well-being because they are concrete things that you can do, and not just think."
                    ]
                }
            ]
        }
    ]
}