{
    "link": "https://www.wikihow.com/Activate-a-Visa-Gift-Card",
    "article": "How to Activate & Register Visa Gift Cards",
    "intro": "Who doesn’t love getting a Visa gift card? You can use it anywhere Visa cards are accepted, and you’ve probably got a long list of bills or fun purchases you want to apply the balance toward ASAP. The card is ready to use as soon as it’s activated, and thankfully, activation is a breeze! In this article, we’ll show you how to activate and register your card by phone or online, plus share some security tips to help you use it safely. You’ll be shopping before you know it!",
    "points": [
        {
            "name": "Activating by Phone",
            "steps": [
                {
                    "step": "3",
                    "title": "Contact Visa directly to resolve any activation issues.",
                    "subtitle": " If you have any questions or concerns during activation or if the activation was unsuccessful for any reason, call, chat, or email Visa’s customer support. Look for the customer service phone number on the back of the card or Google “Visa customer support.”",
                    "sub-points": [
                        "Call Visa customer support at 1-800-847-2911.",
                        "Email Visa through their .",
                        "Click “Start Chat” on  for live assistance online."
                    ]
                },
                {
                    "step": "3",
                    "title": "Contact Visa directly to resolve any activation issues.",
                    "subtitle": " If you have any questions or concerns during activation or if the activation was unsuccessful for any reason, call, chat, or email Visa’s customer support. Look for the customer service phone number on the back of the card or Google “Visa customer support.”",
                    "sub-points": [
                        "Call Visa customer support at 1-800-847-2911.",
                        "Email Visa through their .",
                        "Click “Start Chat” on  for live assistance online."
                    ]
                },
                {
                    "step": "3",
                    "title": "Contact Visa directly to resolve any activation issues.",
                    "subtitle": " If you have any questions or concerns during activation or if the activation was unsuccessful for any reason, call, chat, or email Visa’s customer support. Look for the customer service phone number on the back of the card or Google “Visa customer support.”",
                    "sub-points": [
                        "Call Visa customer support at 1-800-847-2911.",
                        "Email Visa through their .",
                        "Click “Start Chat” on  for live assistance online."
                    ]
                }
            ]
        },
        {
            "name": "Activating Online",
            "steps": [
                {
                    "step": "3",
                    "title": " and activate your card on a secure site only.",
                    "subtitle": " Double check that you’re on a secure website (look for “https” in the page’s URL) belonging to Visa or to the gift card issuer. If a site looks suspicious (maybe it has lots of typos or doesn’t show the name or logo of the card issuer), try activating the card directly through Visa instead.",
                    "sub-points": [
                        "Inspect the card’s packaging before activation. If the packaging is damaged or the security code is exposed, request a new one card."
                    ]
                }
            ]
        },
        {
            "name": "Registering the Card",
            "steps": [
                {
                    "step": "3",
                    "title": "Use your registered card to make phone and internet purchases.",
                    "subtitle": " Provide the same billing information you gave when you registered your card to ensure your transactions go through. If you encounter any identity verification issues, call the customer service number on the back of the card to confirm the billing address and other registration information with a customer service agent.",
                    "sub-points": [
                        "Registration makes it easier to cancel the card, request a new one, and dispute fraudulent charges if it's stolen or missing since it's tied to your identity."
                    ]
                }
            ]
        },
        {
            "name": "Security Considerations",
            "steps": [
                {
                    "step": "4",
                    "title": "Report lost or stolen cards to the gift card provider ASAP.",
                    "subtitle": " Call the toll-free number from the back of the card or locate the provider’s customer service number online. Provide the 16-digit gift card number to the agent so they can cancel and reissue your gift card.",
                    "sub-points": [
                        "You may also need to provide the expiration date or security code from the back of the card."
                    ]
                }
            ]
        }
    ]
}